// See https://aka.ms/new-console-template for more information
// See https://aka.ms/new-console-template for more information
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/*Random random = new Random();
int number = random.Next(99,1000);
Console.WriteLine(number); 

int secondNumber = (number / 10) % 10;
Console.WriteLine(secondNumber);*/

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

/*int n = int.Parse(Console.ReadLine());
if (n > 99)
{
    Console.WriteLine((n / 100) % 10);
}

else
{
    Console.WriteLine("третьей цифры нет");
}*/

//Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.


/*int number = int.Parse(Console.ReadLine());
if (number > 0 && number < 6)
{
    Console.WriteLine("нет");
}
else
{
    Console.WriteLine("да");
}*/